import cv2
import numpy as np

# 左相机内参
# left_camera_matrix = np.array([[1930.42813578491, 0.0, 0.0],
#                                [0.0, 1943.18414972149, 913.0624321772135],
#                                [1508.25170727817, 928.155802676983, 1.0]])
# 左相机内参 转置
left_camera_matrix = np.array([[1930.42813578491, 0.0, 1508.25170727817],
                               [0.0, 1943.18414972149, 928.155802676983],
                               [0.0, 913.0624321772135, 1.0]])

# 左相机畸变系数:[k1, k2, p1, p2, k3]
left_distortion = np.array([[0.105072172336581, -0.168339490923235, 0, 0, 0]])
# left_distortion = np.array([[0.061184671930809, -0.070985616565165, 0, 0, 0]])


# 右相机内参
# right_camera_matrix = np.array([[1946.73694456474, 0.0, 0.0],
#                                 [0.0, 1961.24032210105, 0.0],
#                                 [1411.96698820936, 934.122755163685, 1.0]])
# 右相机内参 转置
right_camera_matrix = np.array([[1946.73694456474, 0.0, 1411.96698820936],
                                [0.0, 1961.24032210105, 934.122755163685],
                                [0.0, 0.0, 1.0]])

# 右相机畸变系数:[k1, k2, p1, p2, k3]
right_distortion = np.array([[0.0489729879217015, -0.0183467432315099, 0, 0, 0]])

# right_distortion = np.array([[0.090500280734898, -0.121715769635955, 0, 0, 0]])

# om = np.array([-0.00009, 0.02300, -0.00372])
# R = cv2.Rodrigues(om)[0]

# R = np.array([[0.999936736583828, 0.000693164730115147, -0.0112268585428447],
#               [-0.000569158553376432, 0.999938840994807, 0.0110449232004295],
#               [0.0112338278705542, -0.0110378345982893, 0.999875975968398]])
# 旋转矩阵 要转置


R = np.array([[0.999936736583828, -0.000569158553376432, 0.0112338278705542],
              [0.000693164730115147, 0.999938840994807, -0.0110378345982893],
              [-0.0112268585428447, 0.0110449232004295, 0.999875975968398]])
# print(R)

T = np.array([22.5840630314746, 0.436149397634734, 2.43329211269206])
# T = np.array([-22.560262324372346,0.179255130147555, 0.413120715555628])

size = (1920, 1080)  # 图像尺寸

# 进行立体更正
R1, R2, P1, P2, Q, validPixROI1, validPixROI2 = cv2.stereoRectify(left_camera_matrix, left_distortion,
                                                                  right_camera_matrix, right_distortion, size, R,
                                                                  T)
# 计算更正map
left_map1, left_map2 = cv2.initUndistortRectifyMap(left_camera_matrix, left_distortion, R1, P1, size, cv2.CV_16SC2)
right_map1, right_map2 = cv2.initUndistortRectifyMap(right_camera_matrix, right_distortion, R2, P2, size, cv2.CV_16SC2)
